Австралия/src/Catalogs/BusinessUnits/BusinessUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>MainDepartment</name>
      <description>Main department</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Main warehouse</description>
    </items>
    <items>
      <name>DropShipping</name>
      <description>Drop shipping</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.BusinessUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientOfWastes</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningInterval</name>
    <type>
      <types>EnumRef.PlanningIntervals</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningIntervalDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/BusinessUnitsTypes/BusinessUnitsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BusinessUnitsTypes</name>
  <enumValues>
    <name>Department</name>
  </enumValues>
  <enumValues>
    <name>Warehouse</name>
  </enumValues>
  <enumValues>
    <name>Retail</name>
  </enumValues>
  <enumValues>
    <name>RetailEarningAccounting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/BusinessUnits/Forms/ListForm/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then
		Return; // Return if the form for analysis is received..
	EndIf;
	
	If Parameters.Property("DoNotCheckCompanyInBusinessUnit") And Parameters.DoNotCheckCompanyInBusinessUnit = True Then
		Parameters.Filter.Delete("Company");
	EndIf;
	
	MainDepartment	= DriveReUse.GetValueOfSetting("MainDepartment");
	MainWarehouse	= DriveReUse.GetValueOfSetting("MainWarehouse");
	
	MainBusinessUnits = New Array;
	MainBusinessUnits.Add(MainDepartment);
	MainBusinessUnits.Add(MainWarehouse);
	List.Parameters.SetParameterValue("MainBusinessUnits", MainBusinessUnits);
	
	ShowDepartment	= True;
	ShowWarehouse	= True;
	
	If Parameters.Filter.Property("StructuralUnitType") Then
		
		ShowDepartment	= False;
		ShowWarehouse	= False;
		
		If TypeOf(Parameters.Filter.StructuralUnitType) = Type("EnumRef.BusinessUnitsTypes") Then
			
			ShowDepartment	= Parameters.Filter.StructuralUnitType = Enums.BusinessUnitsTypes.Department;
			ShowWarehouse	= Not ShowDepartment;
			
		Else
			
			For Each ArrayItem In Parameters.Filter.StructuralUnitType Do
				If ArrayItem = Enums.BusinessUnitsTypes.Department Then
					ShowDepartment = True;
				Else
					ShowWarehouse = True;
				EndIf;
			EndDo;
			
		EndIf;
		
	EndIf;
	
	Title = "";
	If ShowWarehouse AND ShowDepartment Then
		Title = NStr("en = 'Business units'; ru = 'Структурные единицы';pl = 'Jednostki biznesowe';es_ES = 'Unidades empresariales';es_CO = 'Unidades de negocio';tr = 'Departmanlar';it = 'Business unit';de = 'Abteilungen'");
	ElsIf ShowWarehouse Then
		Title = NStr("en = 'Warehouses'; ru = 'Склады';pl = 'Magazyny';es_ES = 'Almacenes';es_CO = 'Almacenes';tr = 'Ambarlar';it = 'Magazzini';de = 'Lager'");
	ElsIf ShowDepartment Then
		Title = NStr("en = 'Departments'; ru = 'Подразделения';pl = 'Działy';es_ES = 'Departamentos';es_CO = 'Departamentos';tr = 'Bölümler';it = 'Reparti';de = 'Abteilungen'");
	EndIf;
	
	Items.FormUseAsMainDepartment.Visible	= ShowDepartment;
	Items.FormUseAsMainWarehouse.Visible	= ShowWarehouse;
	
	Items.Company.Visible = GetFunctionalOption("UseDataSynchronization");
	
	// Exclusion of special predefined warehouse GoodsInTransit from ListForm
	DataFilterItem = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	DataFilterItem.LeftValue = New DataCompositionField("Ref");
	DataFilterItem.ComparisonType = DataCompositionComparisonType.NotEqual;
	DataFilterItem.RightValue = Catalogs.BusinessUnits.GoodsInTransit;
	DataFilterItem.Use = True;
	
	// Exclusion of special predefined warehouse DropShipping from ListForm
	DataFilterItem = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
	DataFilterItem.LeftValue = New DataCompositionField("Ref");
	DataFilterItem.ComparisonType = DataCompositionComparisonType.NotEqual;
	DataFilterItem.RightValue = Catalogs.BusinessUnits.DropShipping;
	DataFilterItem.Use = True;
	
	TypesHierarchy = False;
	If Not (ShowWarehouse AND ShowDepartment) Then
		TypesHierarchy = CheckTypesHierarchy();
	EndIf;
	
	// Set form settings for the case of the opening of the choice mode
	Items.List.ChoiceMode		= Parameters.ChoiceMode;
	Items.List.MultipleChoice	= ?(Parameters.CloseOnChoice = Undefined, False, Not Parameters.CloseOnChoice);
	If Parameters.ChoiceMode Then
		PurposeUseKey = PurposeUseKey + "ChoicePick";
		WindowOpeningMode = FormWindowOpeningMode.LockOwnerWindow;
	Else
		PurposeUseKey = PurposeUseKey + "List";
	EndIf;
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	If TypesHierarchy Then
		Items.List.Representation = TableRepresentation.List;
	EndIf;
	
EndProcedure

#EndRegion

#Region FormItemsEventsHandlers

&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentData = Items.List.CurrentData;
	
	If TypeOf(Items.List.CurrentRow) <> Type("DynamicListGroupRow")
		And CurrentData <> Undefined Then
		
		IsDepartment = (CurrentData.StructuralUnitType = PredefinedValue("Enum.BusinessUnitsTypes.Department"));
		Items.FormUseAsMainDepartment.Enabled	= Not CurrentData.IsMain And IsDepartment;
		Items.FormUseAsMainWarehouse.Enabled	= Not CurrentData.IsMain And Not IsDepartment;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure UseAsMainDepartment(Command)
	
	If TypeOf(Items.List.CurrentRow) = Type("DynamicListGroupRow")
		Or Items.List.CurrentData = Undefined
		Or Items.List.CurrentData.IsMain
		Or Items.List.CurrentData.StructuralUnitType <> PredefinedValue("Enum.BusinessUnitsTypes.Department") Then
		
		Return;
	EndIf;
	
	SetMainStructuralUnit(Items.List.CurrentData.Ref, "MainDepartment");
	Items.FormUseAsMainDepartment.Enabled	= Not Items.List.CurrentData.IsMain;
	
EndProcedure

&AtClient
Procedure UseAsMainWarehouse(Command)
	
	If TypeOf(Items.List.CurrentRow) = Type("DynamicListGroupRow")
		Or Items.List.CurrentData = Undefined
		Or Items.List.CurrentData.IsMain
		Or Items.List.CurrentData.StructuralUnitType = PredefinedValue("Enum.BusinessUnitsTypes.Department") Then
		
		Return;
	EndIf;
	
	SetMainStructuralUnit(Items.List.CurrentData.Ref, "MainWarehouse");
	Items.FormUseAsMainWarehouse.Enabled	= Not Items.List.CurrentData.IsMain;
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure SetMainStructuralUnit(Val NewMainStructuralUnit, SettingName)
	
	DriveServer.SetUserSetting(NewMainStructuralUnit, SettingName);
	
	ThisObject[SettingName] = NewMainStructuralUnit;
	
	MainBusinessUnits = New Array;
	MainBusinessUnits.Add(MainDepartment);
	MainBusinessUnits.Add(MainWarehouse);
	List.Parameters.SetParameterValue("MainBusinessUnits", MainBusinessUnits);
	
EndProcedure

&AtServer
Function CheckTypesHierarchy()
	
	Query = New Query;
	Query.Text =
	"SELECT TOP 1
	|	BusinessUnits.Ref
	|FROM
	|	Catalog.BusinessUnits AS BusinessUnits
	|WHERE
	|	BusinessUnits.Parent <> VALUE(Catalog.BusinessUnits.EmptyRef)
	|	AND BusinessUnits.StructuralUnitType <> BusinessUnits.Parent.StructuralUnitType";
	
	Result = Query.Execute();
	If Result.IsEmpty() Then
		Return False;
	Else
		Return True;
	EndIf;
	
EndFunction

#EndRegion

#Region LibrariesHandlers

// StandardSubsystems.SearchAndDeleteDuplicates

&AtClient
Procedure MergeSelected(Command)
	FindAndDeleteDuplicatesDuplicatesClient.MergeSelectedItems(Items.List);
EndProcedure

&AtClient
Procedure ShowUsage(Command)
	FindAndDeleteDuplicatesDuplicatesClient.ShowUsageInstances(Items.List);
EndProcedure

&AtClient
Procedure Create(Command)
	
	StructureParameters = New Structure;
	
	If ShowWarehouse AND ShowDepartment Then
		StructureParameters.Insert("FilterUnitType", "BusinessUnits");
	ElsIf ShowWarehouse Then
		StructureParameters.Insert("FilterUnitType", "Warehouse");
	ElsIf ShowDepartment Then
		StructureParameters.Insert("FilterUnitType", "Department");
		StructureParameters.Insert("StructuralUnitType", PredefinedValue("Enum.BusinessUnitsTypes.Department"));
	EndIf;
	
	OpenForm("Catalog.BusinessUnits.ObjectForm", StructureParameters);
	
EndProcedure

// End StandardSubsystems.SearchAndDeleteDuplicates

#EndRegion
